andrew867/dashcdg/platform/espidf/projects/dashcdg_badge/sdkconfig.defaults
# Freenove ESP32 CYD-class boards: ESP32 (not S2/S3/C3), 4 MB flash typical.
CONFIG_IDF_TARGET="esp32"

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Dual OTA slots (A/B) on 4 MB flash — see partitions_ota_4mb.csv
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_ota_4mb.csv"

CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# UART console (115200 is ESP-IDF default)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# ESP-IDF 5.5 keeps FreeRTOS static allocation enabled internally.
# Keep early startup task stacks lean to avoid scheduler-start alloc asserts.
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=1024
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=1536
CONFIG_ESP_TIMER_TASK_STACK_SIZE=2048
# Lab PCM uses esp_timer ISR dispatch when available (accurate sample clock vs ESP_TIMER_TASK).
CONFIG_ESP_TIMER_SUPPORTS_ISR_DISPATCH_METHOD=y
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=1792

# XPT2046: keep raw ADC; map with Freenove cal bounds in display_lvgl.c (see board_cyd_freenove_32.h)
CONFIG_XPT2046_CONVERT_ADC_TO_COORDS=n
# PENIRQ low-power path (GPIO36 + ~10k pull-up on CYD); display_lvgl.c forces LV_INDEV_MODE_TIMER after add_touch.
CONFIG_XPT2046_INTERRUPT_MODE=y

# --- Internal DRAM headroom (CDG+jitter default .bss; optional CONFIG_DASHCDG_BADGE_RX_CDG_ON_HEAP frees after rx_stop) ---
# Strip v4 repair NACK uplink (saves code/RAM; enable in menuconfig if needed).
CONFIG_DASHCDG_BADGE_ENABLE_REPAIR_NACK=n
# IPv4-only badge path (multicast / STA); frees lwIP IPv6 pools.
CONFIG_LWIP_IPV6=n

# Wi-Fi RX/TX pools (defaults ~10 static RX + 32/32 dynamic on ESP32).
# With AMPDU enabled, Espressif recommends keeping static RX buffers at least 6 (below 6 only if
# AMPDU is off). See ESP-IDF Wi-Fi buffer / QoS docs.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
# AMPDU (802.11n block ack): better airtime efficiency on many APs; uses a bit more Wi-Fi driver RAM for
# reorder/BA state. Disabled previously for internal-RAM headroom; re-enabled to help RX bursty UDP
# (multicast karaoke). If Opus init fails more often, try n/n again or lower DYNAMIC_*_BUFFER_NUM slightly.
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=16

# Do not restore a previous lwIP DHCP lease after reboot (cleaner when switching APs / lab networks).
CONFIG_LWIP_DHCP_RESTORE_LAST_IP=n

# lwIP: badge opens mcast x3 + ucast x3 + uplink (+ mDNS) — 6 was too few; extra UDP PCBs fail silently.
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_MAX_ACTIVE_TCP=4
CONFIG_LWIP_MAX_LISTENING_TCP=4
CONFIG_LWIP_MAX_UDP_PCBS=12
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16
